# clone taps
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# brews
brew "bat"
brew "choose-rust"
brew "clojure-lsp"
brew "colordiff"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "curlie"
brew "docker"
brew "dos2unix"
brew "entr"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-extras"
brew "git-secret"
brew "glow"
brew "hub"
brew "jid"
brew "jq"
brew "just"
brew "k3d"
brew "k9s"
brew "koekeishiya/formulae/yabai"
brew "kubectx"
brew "kubetail"
brew "kustomize"
brew "lastpass-cli"
brew "leiningen"
brew "lsd"
brew "maven"
brew "mtr"
brew "ncdu"
brew "neovim"
brew "newsboat"
brew "nmap"
brew "nnn"
brew "podman"
brew "pwgen"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "sd"
brew "shellcheck"
brew "shfmt"
brew "skhd"
brew "sqlite"
brew "terminal-notifier"
brew "tig"
brew "tmux"
brew "tmux-xpanes"
brew "tree"
brew "watchexec"
brew "weechat"
brew "yq"
brew "zsh"

mas "Amphetamine", id: 937984704

# casks
cask "alfred"
cask "authy"
cask "disk-inventory-x"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "iina"
cask "insomnia"
cask "kitty"
cask "lastpass"
cask "licecap"
cask "mtmr"
cask "notion"
cask "obsidian"
cask "slack"
cask "spectacle"
cask "spotify"
cask "visual-studio-code"
cask_args appdir: "/Applications"
