# clone taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "koekeishiya/formulae"

# brews
brew "bat"
brew "cask"
brew "chunkwm"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "docker"
brew "entr"
brew "exa"
brew "fd"
brew "fzf"
brew "git"
brew "git-secret"
brew "gnu-sed"
brew "go"
brew "hub"
brew "jq"
brew "kind"
brew "kubectx"
brew "kubernetes-cli"
brew "lastpass-cli"
brew "mtr"
brew "ncdu"
brew "neovim"
brew "newsboat"
brew "nmap"
brew "nnn"
brew "node"
brew "prometheus"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "skhd"
brew "sqlite"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "unrar"
brew "watchexec"
brew "weechat"
brew "zsh"

# casks
cask "alfred"
cask "authy"
cask "disk-inventory-x"
cask "docker"
cask "dropbox"
cask "emacs"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-source-code-pro"
cask "iina"
cask "kitty"
cask "licecap"
cask "minikube"
cask "mtmr"
cask "notion"
cask "obsidian"
cask "oracle-jdk"
cask "slack"
cask "spectacle"
cask "spotify"
cask "vagrant"
cask "visual-studio-code"
cask_args appdir: "/Applications"
