# clone taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "koekeishiya/formulae"

# brews
brew "cask"
brew "chunkwm"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "docker"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "gnu-sed"
brew "go"
brew "htop"
brew "hub"
brew "kubernetes-cli"
brew "lastpass-cli"
brew "mtr"
brew "ncdu"
brew "neovim"
brew "newsboat"
brew "nmap"
brew "node"
brew "prometheus"
brew "ripgrep"
brew "skhd"
brew "sqlite"
brew "terminal-notifier"
brew "tig"
brew "tmux"
brew "tree"
brew "unrar"
brew "weechat"

# casks
cask_args appdir: "/Applications"
cask "spotify"
cask "alfred"
cask "disk-inventory-x"
cask "docker"
cask "firefox-developer-edition"
cask "font-source-code-pro"
cask "iina"
cask "kitty"
cask "licecap"
cask "minikube"
cask "oracle-jdk"
cask "qutebrowser"
cask "slack"
cask "spotify"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "authy"
